#include <iostream>
#include <windows.h>
#include <ctime>
#include <conio.h>
using namespace std;

int main()
{
	srand(time(0)); // çàïóñê ãåíåðàòîðà ñëó÷àéíûõ ÷èñåë
	rand(); // õîëîñòîé õîä ãåíåðàòîðà ñëó÷àíûé ÷èñåë
	system("mode con cols=51 lines=31"); // óñòàíîâêà ðàçìåðîâ îêíà êîíñîëè
	MoveWindow(GetConsoleWindow(), 50, 50, 2000, 2000, true); // óñòàíîâêà ñòàðòîâîé ïîçèöèè îêíà êîíñîëè (50 è 50 - ýòî ïèêñåëè
	// îòíîñèòåëüíî âåðõíåãî ëåâîãî óãëà ìîíèòîðà
	const int width = 50, height = 30; // ðàçìåðû ïîëÿ, ïî êîòîðîìó áåãàåò çìåéêà
	const int max_length = 50; // óñòàíîâêà ìàêñèìàëüíîé äëèíû "çìåéêè"
	int array_X[max_length]; // ìàññèâ,õðàíÿùèé àáñöèññû çâåíüåâ "çìåéêè"
	int array_Y[max_length]; // ìàññèâ, õðàíÿùèé îðäèíàòû çâåíüåâ "çìåéêè"
	int length = 1; // ïåðåìåííàÿ äëèíû "çìåéêè"
	array_X[0] = width / 2; // óñòàíîâêà ñòàðòîâîé àáñöèññû "çìåéêè"
	array_Y[0] = height / 2; // óñòàíîâêà ñòàðòîâîé îðäèíàòû "çìåéêè"
	int dx = 1, dy = 0; // ñîçäàíèå ñìåùåíèé ïî îñÿì äëÿ äâèæåíèÿ "çìåéêè"
	int X_apple; // àáñöèññà "ÿáëîêà"
	int Y_apple; // îðäèíàòà "ÿáëîêà"
	do // öèêë ñòàâèò êîîðäèíàòû ÿáëîêà ñëó÷àíéì îáðàçîì - íî ÷òîáû îíè íå ñîâïàäàëè ñî "çìåéêîé"
	{
		X_apple = rand() % (width - 2) + 1;
		Y_apple = rand() % (height - 2) + 1;
	} while (X_apple != array_X[length - 1] && Y_apple != array_Y[length - 1]);

	int sleep_time = 100; // ïåðåìåííàÿ ÷àñòîòû êàäðîâ

	char snake = '*'; // ñèìâîë äëÿ îòîáðàæåíèÿ òåëà "çìåéêè"
	char apple = 'o'; // ñèìâîë äëÿ îòîáðàæåíèÿ "ÿáëîêà"
	char head = 1; // ñèìâîë äëÿ îòîáðàæåíèÿ ãîëîâû "çìåéêè"
	COORD c; // îáúåêò äëÿ õðàíåíèÿ êîîðäèíàò
	HANDLE h = GetStdHandle(STD_OUTPUT_HANDLE); // ñîçäàíèå õåíäëà ïîòîêà âûâîäà
	CONSOLE_CURSOR_INFO cci = { sizeof(cci), false }; // ñîçäàíèå ïàðàìåòðîâ íà îòîáðàæåíèå êóðñîðà
	SetConsoleCursorInfo(h, &cci); //ñâÿçûâàíèå ïàðàìåòðîâ è õåíäëà

	SetConsoleTextAttribute(h, 4); // óñòàíîâêà öâåòà, êîòîðûì ðèñóåòñÿ ðàìêà ïîëÿ
	for (int y = 0; y < height; y++) // ñòàíäàðòíûé äâîéíîé öèêë íà îòðèñîâêó ðàìêè
	{
		for (int x = 0; x < width; x++)
		{
			char s;
			if (x == 0 && y == 0) // â âåðõíåì ëåâîì óãëó ïîëÿ - ñèìâîë ñîîòâåòñòâóþùåãî óãëà
				s = 218;
			else if (x == 0 && y == height - 1) // íèæíèé ëåâûé óãîë
				s = 192;
			else if (y == 0 && x == width - 1) // âåðõíèé ïðàâûé óãîë
				s = 191;
			else if (y == height - 1 && x == width - 1) // íèæíèé ïðàâûé óãîë
				s = 217;
			else if (y == 0 || y == height - 1) // âåðõíÿÿ è íèæíÿÿ ãðàíèöà ïîëÿ
				s = 196;
			else if (x == 0 || x == width - 1) // ëåâàÿ è ïðàâàÿ ãðàíèöà ïîëÿ
				s = 179;
			else s = ' '; // âî âñåõ îñòàëüíûõ ñëó÷àÿõ äîëæåí áûòü ïðîñòî ïðîáåë (îçíà÷àåò ïóñòóþ îáëàñòü ïîëÿ)
			putchar(s); // âûâîäèì ñèìâîë
		}
		cout << endl;
	}

	c.X = X_apple; // ñâÿçûâàåì îáúåêò êîîðäèíàò ñ ïîçèöèÿìè "ÿáëîêà"
	c.Y = Y_apple;
	SetConsoleCursorPosition(h, c); // îòïðàâëÿåì êóðñîð íà ïîçèöèþ "ÿáëîêà"
	SetConsoleTextAttribute(h, 12); // óñòàíàâëèâàåì êðàñíûé öâåò äëÿ îòðèñîâêè "ÿáëîêà"
	putchar(apple); // îòîáðàæàåì ñèìâîë "ÿáëîêà"

	c.X = array_X[0]; // ñâÿçûâàåì îáúåêò êîîðäèíàò ñî ñòàðòîâîé ïîçèöèåé "çìåéêè"
	c.Y = array_Y[0];
	SetConsoleCursorPosition(h, c); // îòïðàâëÿåì êóðñîð íà ïîçèöèþ ãîëîâû "çìåéêè"
	SetConsoleTextAttribute(h, 10); // óñòàíàâëèâàåì çåëåíûé öâåò äëÿ îòðèñîâêè "çìåéêè"
	putchar(head); // îòîáðàæàåì ñèìâîë ãîëîâû "çìåéêè"

	bool flag = true; // ïåðåìåííàÿ äëÿ óïðàâëåíèÿ õîäîì öèêëà
	do // ñîáñòâåííî öèêë èãðû
	{
		Sleep(sleep_time); // çàäåðæêà ïîòîêà ïðîãðàììû íà çàäàííûé ðàíåå èíòåðâàë

		if (_kbhit()) // ïðîâåðÿåì, áûëà ëè íàæàòà êàêàÿ-ëèáî êëàâèøà è çàïóñêàåì å¸ îáðàáîòêó â ñëó÷àå ÈÑÒÈÍÛ
		{
			int k = _getch(); // ñ÷èòûâàåì êîä êëàâèøè èç áóôåðà
			if (k == 0 || k == 224) // åñëè ïåðâûé êîä - âñïîìîãàòåëüíûé, ñ÷èòûâàåì âòîðîé êîä
				k = _getch();
			switch (k) // ïðîïóñêàåì êîä íàæàòîé êëàâèøè âíóòðü îïåðàòîðà âûáîðà
			{
			case 80: // åñëè áûëà íàæàòà êëàâèøà âíèç
				dy = 1; // òî ïðèðàùåíèå ïî îñè îðäèíàò áóäåò ïîëîæèòåëüíûì
				dx = 0; // ïî îñè àáñöèññ ïðèðàùåíèå íóëåâîå
				break;
			case 72: // åñëè ââåðõ
				dy = -1; // àíàëîãè÷íî ñîãëàñíî ãåîìåòðè÷åñêîé ëîãèêå
				dx = 0;
				break;
			case 75: // åñëè âëåâî
				dy = 0;
				dx = -1;
				break;
			case 77: // åñëè âïðàâî
				dy = 0;
				dx = 1;
				break;
			case 27: // åñëè áûëà íàæàòà êëàâèøà ESC
				flag = false; // óñòàíàâëèâàåì ôëàæîê íà ËÎÆÜ, ÷òîá çàêîí÷èòü ïîêàç äâèæåíèÿ
				break;
			}
		}

		int X = array_X[length - 1] + dx; // îïðåäåëÿåì çíà÷åíèå àáñöèññû ãîëîâû "çìåéêè" ïîñëå ñìåùåíèÿ
		int Y = array_Y[length - 1] + dy; // òî æå ñàìîå äëÿ îðäèíàòû
		if (X == 0 || X == width - 1 || Y == 0 || Y == height - 1) // ïðîâåðêà íà äîñòèæåíèå ãðàíèö ïîëÿ
		{
			flag = false; // ïîêà ÷òî - ïðîñòî óñòàíîâêà óïðàâëÿþùåé ïåðåìåííîé öèêëà
		}
		else if (X == X_apple && Y == Y_apple) // ïðîâåðêà íà äîñòèæåíèå "ÿáëîêà"
		{
			c.X = array_X[length - 1]; // óñòàíîâêà â îáúåêò êîîðäèíàò ïîçèöèè ãîëîâû "çìåéêè"
			c.Y = array_Y[length - 1];
			SetConsoleCursorPosition(h, c); // óñòàíîâêà êóðñîðà â ýòó ïîçèöèþ
			putchar(snake); // îòîáðàæåíèå ñèìâîëà òåëà "çìåéêè"

			length++; // óâåëè÷åíèå äëèíû "çìåéêè" (ÿáëîêî ïðîãëî÷åíî)
			c.X = array_X[length - 1] = X; // óñòàíîâêà â ìàññèâû ïîçèöèè íîâîãî çâåíà "çìåéêè"
			c.Y = array_Y[length - 1] = Y;
			SetConsoleCursorPosition(h, c); // óñòàíîâêà òóäà êóðñîðà
			putchar(head); // è îòîáðàæåíèå òàì ñèìâîëà ãîëîâû "çìåéêè"

			if (length == max_length) // ïðîâåðêà, äîñòèãëà ëè äëèíà "çìåéêè" ñâîåãî ìàêñèìàëüíîãî çíà÷åíèÿ
			{
				break; // ïîêà ÷òî - ïðîñòî ïðåðûâàåì öèêë
			}

			int i; // ïåðåìåííàÿ äëÿ ïîäñ÷åòà êîëè÷åñòâà çâåíüåâ "çìåéêè", íå ñîâïàäàþùèõ ñ ïîçèöèåé "ÿáëîêà"
			do
			{
				X_apple = rand() % (width - 2) + 1; // óñòàíîâêà íîâûõ êîîðäèíàò "ÿáëîêà"
				Y_apple = rand() % (height - 2) + 1;
				i = 0; // îáíóëåíèå ÷èñëà íåñîâïàäàþùèõ êîîðäèíàò
				for (; i < length; i++) // çàïóñê öèêëà íà ñâåðêó ñîâïàäåíèé
				if (X_apple == array_X[i] && Y_apple == array_Y[i]) // åñëè ñîâïàäåíèå íàéäåíî
					break; // òî ïðåðûâàåì öèêë for
			} while (i < length); // ïîèñê íîâûõ êîîðäèíàò ïðîäîëæàåòñÿ, ïîêà ÷èñëî íåñîâïàäàþùèõ êîîðäèíàò ìåíüøå äëèíû "çìåéêè"

			c.X = X_apple; // óñòàíîâêà â îáúåêò êîîðäèíàò íîâîé êîððåêòíîé ïîçèöèè "ÿáëîêà"
			c.Y = Y_apple;
			SetConsoleCursorPosition(h, c); // îòïðàâêà òóäà êóðñîðà
			SetConsoleTextAttribute(h, 12); // óñòàíîâêà öâåòà â êðàñíûé
			putchar(apple); // îòîáðàæåíèå ñèìâîëà "ÿáëîêà"
			SetConsoleTextAttribute(h, 10); // îáðàòíàÿ óñòàíîâêà öâåòà â çåëåíûé - äëÿ äàëüíåéøåãî îòîáðàæåíèÿ "çìåéêè"
		}
		else // ñëó÷àé, êîãäà ãîëîâà "çìåéêè" îêàçàëàñü íà íîâîé ïóñòîé ïîçèöèè
		{
			int i = 1; // ïåðåìåííàÿ íà êîëè÷åñòâî çâåíüåâ, íå ñîâïàäàþùèõ ñ íîâîé ïîçèöèåé - êðîìå õâîñòà "çìåéêè"
			for (; i < length; i++)
			if (X == array_X[i] && Y == array_Y[i]) // åñëè ñîâïàäåíèå íàéäåíî â öèêëå - ïðåðûâàåìñÿ
				break;
			if (i < length) // åñëè ÷èñëî íåñîâïàäàþùèõ çâåíüåâ ìåíüøå äëèíû "çìåéêè" - òî ïðåðûâàåì îñíîâíîé öèêë èãðû
			{
				break;
			}
			else // à èíà÷å çàïóñêàåì îáðàáîòêó ñäâèãà "çìåéêè"
			{
				c.X = array_X[0]; // óñòàíàâëèâàåì â îáúåêò êîîðäèíàò ïîçèöèþ õâîñòà "çìåéêè"
				c.Y = array_Y[0];
				SetConsoleCursorPosition(h, c); // äâèãàåì òóäà êóðñîð
				putchar(' '); // è îòîáðàæàåì ïðîáåë (çàòèðêà õâîñòà)

				if (length > 1) // åñëè äëèíà çìåéêè áîëüøå
				{
					c.X = array_X[length - 1]; // óñòàíàâëèâàåì â îáúåêò êîîðäèíàò ïðåäûäóùóþ ïîçèöèþ ãîëîâû "çìåéêè"
					c.Y = array_Y[length - 1];
					SetConsoleCursorPosition(h, c);  // äâèãàåì òóäà êóðñîð
					putchar(snake); // âûâîäèì ñèìâîë òåëà "çìåéêè"
				}

				for (int i = 0; i < length - 1; i++) // çàïóñêàåì öèêë ñâäèãà êîîðäèíàò çâåíüåâ "çìåéêè"
				{
					array_X[i] = array_X[i + 1]; // îáðàáàòûâàåì âñå çâåíüÿ - êðîìå ïîñëåäíåãî
					array_Y[i] = array_Y[i + 1];
				}

				c.X = array_X[length - 1] = X; // óñòàíàâëèâàåì íîâóþ ïîçèöèþ ãîëîâû "çìåéêè"
				c.Y = array_Y[length - 1] = Y;
				SetConsoleCursorPosition(h, c); // äâèãàåì òóäà êóðñîðà
				putchar(head); // îòîáðàæàåì ñèìâîë ãîëîâû "çìåéêè"
			}
		}
	} while (flag); // âûõîäèì èç öèêëà, åñëè ñáðîøåíà óïðàâëÿþùàÿ ïåðåìåííàÿ
	system("cls"); // î÷èùàåì ýêðàí
	cout << "OONNUU BUTTE\n"; // âûâîäèì ñîîáùåíèå î êîíöå èãðû
	system("pause");
}
